app/views/spots/index.html.erb

SELECT "spots".* FROM "spots" ORDER BY "spots"."created_at" DESC
---
                    }
                    $(".myspots-content").on("click", "tr", function() {
                        var latitude = $(this).children(".lat").attr("class").split(' ')[0];
                        var longitude = $(this).children(".long").attr("class").split(' ')[0];
                        console.log($(this).children(".lat").attr("class").split(' ')[0]);
                        var laLatLng = new google.maps.LatLng(latitude, longitude);
                        handler.map.serviceObject.panTo(laLatLng);
                        handler.map.serviceObject.setZoom(18);
                    });