app/views/static_pages/city.html.erb

    <script type="text/javascript" defer>
      $(function() {
        console.log("hi");
        handler = Gmaps.build('Google');
        handler.buildMap({ provider: { }, internal: {id: 'map'}}, function(){
          markers = handler.addMarkers(<%=raw @hash.to_json %>);
          handler.bounds.extendWith(markers);
          handler.fitMapToBounds();
          handler.map.serviceObject.setZoom(12);
        });

        $(".spots-content").on("click", "tr", function() {
        var latitude = $(this).children(".lat").attr("class").split(' ')[0];
        var longitude = $(this).children(".long").attr("class").split(' ')[0];
        console.log($(this).children(".lat").attr("class").split(' ')[0]);
        var laLatLng = new google.maps.LatLng(latitude, longitude);
        handler.map.serviceObject.panTo(laLatLng);
        handler.map.serviceObject.setZoom(18);
        });
      });
---
SELECT "spots".* FROM "spots" WHERE (title || address || description ILIKE '%Ponce City Market%') ORDER BY created_at DESC