app/controllers/comments_controller.rb

  def create
    @spot = Spot.find(params[:spot_id])
    @comment = @spot.comments.new(params[:comment].permit(:body))
    @comment.user = current_user
    @comment.save
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
INSERT INTO "comments" ("spot_id", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["spot_id", 34], ["body", "This is BS"], ["created_at", 2016-10-07 17:18:20 UTC], ["updated_at", 2016-10-07 17:18:20 UTC], ["user_id", 8]]