app/controllers/spots_controller.rb

  def index
    @spots = current_user.spots.order(created_at: :desc)
---
SELECT "spots".* FROM "spots" WHERE "spots"."user_id" = $1 ORDER BY "spots"."created_at" DESC  [["user_id", 1]]

  def show
    @spot =Spot.find(params[:id])
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @spot = Spot.new(spot_params)
    @spot.user = current_user        # associate the new todo to the current_user

    respond_to do |format|
      if @spot.save
---
INSERT INTO "spots" ("address", "time_limit", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "123 main street"], ["time_limit", "1 hour"], ["created_at", 2016-10-02 17:23:03 UTC], ["updated_at", 2016-10-02 17:23:03 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @spot.update(spot_params)
---
UPDATE "spots" SET "time_limit" = $1, "description" = $2, "updated_at" = $3 WHERE "spots"."id" = $4  [["time_limit", "Not Free for sure!"], ["description", "Dont park here! Boot-town!"], ["updated_at", 2016-10-07 17:18:01 UTC], ["id", 36]]

  def destroy
    @spot.destroy
---
DELETE FROM "spots" WHERE "spots"."id" = $1  [["id", 1]]

    def set_spot
      @spot = Spot.find(params[:id])
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]