app/controllers/static_pages_controller.rb

SELECT "spots".* FROM "spots" WHERE (title || address || description ILIKE '%Ponce City Market%') ORDER BY created_at DESC
---
  def city
    @spots = Spot.all