app/controllers/todos_controller.rb

  def index
    @todos = Todo.order(created_at: :desc)
---
SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "What"], ["completed", false], ["created_at", 2016-10-01 21:38:54 UTC], ["updated_at", 2016-10-01 21:38:54 UTC]]